12/data/attachments/85ce50b72be1208.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bc07b27b-98ea-4754-abc5-99e04a57ce90</nif:username>
            <nif:friendToBeAdded>Joseph_week_Friend_12573_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>